package com.best.kgw.service;

import com.vo.EmpVO;

import java.util.List;

public interface AdminSevice {

    /**********************************************************************************
     작성자 : 이동건
     작성일자 : 24.02.19
     기능 : 사원추가 인터페이스
     **********************************************************************************/
    public int regist(EmpVO empVO) throws Exception;

    /**********************************************************************************
     작성자 : 이동건
     작성일자 : 24.02.19
     기능 : 사원목록 인터페이스
     **********************************************************************************/
    public List<EmpVO> empList(EmpVO empVO) throws Exception;

    /**********************************************************************************
     작성자 : 이동건
     작성일자 : 24.02.21
     기능 : 사원수정 인터페이스
     **********************************************************************************/
    public int empInfoUpdate(EmpVO empVO) throws Exception;

    /**********************************************************************************
     작성자 : 이동건
     작성일자 : 24.02.23
     기능 : 사원검색 인터페이스
     **********************************************************************************/
    public List<EmpVO> empSerach(EmpVO empVO);
    /**********************************************************************************
     작성자 : 이동건
     작성일자 : 24.03.03
     기능 : 사원수정 인터페이스
     **********************************************************************************/
    public int empInfoUpdate2(EmpVO empVO) throws Exception;

}
